# a = float(input("введите число а:"))
# b = float(input("введите число б:"))
# c = float(input("введите число в:"))

# suma = int(a + b + c)
# division = int(a / b / c)
# print("Сума чисел буде - ", suma, "Якщо поділити \
#     числа сума буде рівна - ", division)
# введите число а:78
# введите число б:9
# введите число в:3
# Сума чисел буде -  90 Якщо поділити     числа сума буде рівна -  2



#input
# name = input("Як Ваше імʼя? ")
# suname = input("як Ваша фамілія? ")
# fullname = name + " " + suname
# print("добрий день " + fullname)

# a = float(input("Введіть данні в метрах: "))
# b = a/1000
# print("В кілометрах буде ", b, "км")

# a = float(input("Введіть данні в метрах: "))
# b = a*1000
# print("В міліметрах буде ", b, "мм")