# Два списка целых заполняются случайными числами. Необходимо:
# ■ Сформировать третий список, содержащий элементы обоих списков;
# Сформировать третий список, содержащий элементы обоих списков 
# без повторений;
# Сформировать третий список, содержащий элементы общие для 
# двух списков;
# Сформировать третий список, содержащий только уникальные 
# элементы каждого из списков;
# Сформировать третий список, содержащий только минимальное 
# и максимальное значение каждого из списков.


# import random


# Сформировать третий список, содержащий элементы обоих списков;
# Group 1
# group_1 = [random.randint(5,30) for i in range(random.randint(5,30))]

# print(group_1)

# # Group 2
# group_2 = [random.randint(5,30) for i in range(random.randint(5,30))]

# print(group_2)
# group_1 = [16, 28, 21, 17, 23, 11, 7, 12, 15, 7, 19, 19, 18, 26, 21, 24, 19]
# group_2 = [16, 25, 27, 24, 30, 6, 25, 27, 25, 24, 17, 13, 24, 23, 17, 14, 27, 23, 25, 20, 7, 19, 30]
# Варіант 1
# group_3 = group_1 + group_2

# print(group_3)
# # [16, 28, 21, 17, 23, 11, 7, 12, 15, 7, 19, 19, 18, 26, 21, 24, 19, 16, 
# # 25, 27, 24, 30, 6, 25, 27, 25, 24, 17, 13, 24, 23, 17, 14, 27, 23, 25, 20, 7, 19, 30]

# варіант 2
# combined_list = [group_1, group_2]
# group_3 = [i for sublist in combined_list for i in sublist]

# print (group_3)
# [16, 28, 21, 17, 23, 11, 7, 12, 15, 7, 19, 19, 18, 26, 21, 24, 19, 16, 
# 25, 27, 24, 30, 6, 25, 27, 25, 24, 17, 13, 24, 23, 17, 14, 27, 23, 25, 20, 7, 19, 30]



# =============================================


# Сформировать третий список, содержащий элементы обоих списков 
# без повторений;
# group_1 = [16, 28, 21, 17, 23, 11, 7, 12, 15, 7, 19, 19, 18, 26, 21, 24, 19]
# group_2 = [16, 25, 27, 24, 30, 6, 25, 27, 25, 24, 17, 13, 24, 23, 17, 14, 27, 23, 25, 20, 7, 19, 30]

# unique_group_3 = (list(set(group_1))) + (list(set(group_2)))

# print(unique_group_3)

# [7, 11, 12, 15, 16, 17, 18, 19, 21, 23, 24, 26, 28, 6, 7, 13, 14, 16, 17, 19, 20, 23, 24, 25, 27, 30]

# ================================================

# Сформировать третий список, содержащий элементы общие для 
# двух списков;


# group_1 = [16, 28, 21, 17, 23, 11, 7, 12, 15, 7, 19, 19, 18, 26, 21, 24, 19]
# group_2 = [16, 25, 27, 24, 30, 6, 25, 27, 25, 24, 17, 13, 24, 23, 17, 14, 27, 23, 25, 20, 7, 19, 30]
# group_3 = [i for i in group_1 if i in group_2]

# print(group_3)
# [16, 17, 23, 7, 7, 19, 19, 24, 19]

# ==================================
# Сформировать третий список, содержащий только уникальные 
# элементы каждого из списков

# group_1 = [16, 28, 21, 17, 23, 11, 7, 12, 15, 7, 19, 19, 18, 26, 21, 24, 19]
# group_2 = [16, 25, 27, 24, 30, 6, 25, 27, 25, 24, 17, 13, 24, 23, 17, 14, 27, 23, 25, 20, 7, 19, 30]
# group_3 = [i for i in group_1 if i not in group_2] + [i for i in group_2 if i not in group_1]

# print(group_3)
# [28, 21, 11, 12, 15, 18, 26, 21, 25, 27, 30, 
# 6, 25, 27, 25, 13, 14, 27, 25, 20, 30]

# ============================================

# Сформировать третий список, содержащий только минимальное 
# и максимальное значение каждого из списков.

group_1 = [16, 28, 21, 17, 23, 11, 7, 12, 15, 7, 19, 19, 18, 26, 21, 24, 19]
group_2 = [16, 25, 27, 24, 30, 6, 25, 27, 25, 24, 17, 13, 24, 23, 17, 14, 27, 23, 25, 20, 7, 19, 30]

group_3 = min(group_1), +min(group_2), + max(group_1), + max(group_2)

print(group_3)
# (7, 6, 28, 30)